<?php defined('SYSPATH') OR die('No direct access allowed.');

$lang = array
(
	'decline' => array
	(
		'avs' => 'Погрешен AVS; внесената адреса не е иста со наплатната адреса заведена во банката.',
		'cvv' => 'Погрешен CVV; внесениот број не е точниот број за верификација на оваа картичка.',
		'call' => 'Картичката мора мануелно да се авторизира преку телефон. Може да се јавите на бројот на сервисот за клиенти кој е напишан на картичката и да побарате offline authcode, кој потоа може да се напише во полето offlineauthcode.',
		'expiredcard' => 'Картичката е истечена. Побарајте продолжување на датумот на валидност.',
		'carderror' => 'Бројот на картичката е погрешен, можеби е згрешен или картичката е пријавена дека е украдена.',
		'authexpired' => 'Пробавте да се пост-авторизирате со помината (повеќе од 14 дена) пред-авторизација.',
		'fraud' => 'CrediGuard fraud score е под побараната граница.',
		'blacklist' => 'Вклучена е CrediGuard blacklist вредност.',
		'velocity' => 'Вклучен е CrediGuard velocity control.',
		'dailylimit' => 'Достигнат е дневниот лимит на бројот на трансакции или на вредноста.',
		'weeklylimit' => 'Достигнат е неделниот лимит на бројот на трансакции или на вредноста.',
		'monthlylimit' => 'Достигнат е месечниот лимит на бројот на трансакции или на вредноста.'
	),
	'baddata' => array
	(
		'missingfields' => 'Еден или повеќе задолжителни параметри за овој тип на трансакција не се напишани.',
		'extrafields' => 'Испратени се параметри кои не се дозволени за овој вид на трансакција.',
		'badformat' => 'Полето неправилно е форматирано, како на пример, букви во нумеричко поле.',
		'badlength' => 'Полето содржи подолга или пократка вредност дозволена од серверот.',
		'merchantcantaccept' => 'Трговецот не го одобрува податокот од ова поле.',
		'mismatch' => 'Податокот во едно од спорните полиња не е соодветно со другото.'
	),
	'error' => array
	(
		'cantconnect' => 'Не е остварено поврзување со TrustCommerce gateway. Проверете дали интернет конекцијата е во ред.',
		'dnsfailure' => 'TCLink софтверот не можеше да ги добие имињата на DNS хостовите. Проверете дали ваква проверка е возможна на овој компјутер.',
		'linkfailure' => 'Конекцијата беше остварена, но се прекина пред трансакцијата да заврши.',
		'failtoprocess' => 'Банковните сервери се исклучени и не можат да овластат трансакции. Пробајте повторно за неколку минути или пробајте со картичка издадена од друга банка.',
	)
);