<?php defined('SYSPATH') OR die('No direct access allowed.');

$lang = array
(
	'required'                 => 'Поля, обязатеьные для заполения: %s',
	'gateway_connection_error' => 'Ошибка при подключении к шлюзу оплаты. Если это повторится, пожалуйста, уведомите администрацию сайта.',
	'invalid_certificate'      => 'Файл сертификата недействителен: %s',
	'no_dlib'                  => 'Ошибка при загрузке динамической библиотеки: %s',
	'error'                    => 'Ошибка при обработке транзакции: %s',
);
