<?php defined('SYSPATH') OR die('No direct access allowed.');

$lang = array
(
	'decline' => array
	(
		'avs' => 'Ошибка AVS; указанный адрес не совпадает с данными банка.',
		'cvv' => 'Ошибка CVV; указанный номер не является корректным проверочным номером карты.',
		'call' => 'Карта должна быть авторизована телефонным звонком. Вы можете позвонить по указанному номеру поддержки клиентов и попросить код авторизации.',
		'expiredcard' => 'Срок действия карты истёк. Активизируйте карту в банке.',
		'carderror' => 'Номер карты недействителен. Возможно, вы ошиблись при вводе номера, или карта заявлена украденной.',
		'authexpired' => 'Повторной авторизация не удалась.',
		'fraud' => 'CrediGuard оценивает эту транзакцию как попытку мошенничества.',
		'blacklist' => 'CrediGuard обнаружил значения в чёрном списке.',
		'velocity' => 'CrediGuard velocity control активирована.',
		'dailylimit' => 'Достигнуто ограничение количества транзакций в день.',
		'weeklylimit' => 'Достигнуто ограничение количества транзакций в неделю.',
		'monthlylimit' => 'Достигнуто ограничение количества транзакций в месяц.',
	),
	'baddata' => array
	(
		'missingfields' => 'Недостаточно параметров для выполнения этой транзакции.',
		'extrafields' => 'Были переданы параметры, запрещённые для этого типа транзакции.',
		'badformat' => 'Параметр имеет некорректный формат, например буквы в численном параметре.',
		'badlength' => 'Длина параметра не соответствует разрешённым пределам.',
		'merchantcantaccept' => 'Посредник не принимает данные, переданные этим параметром.',
		'mismatch' => 'Данные одного из параметров не соответствуют данным других параметров.',
	),
	'error' => array
	(
		'cantconnect' => 'Не удалось подключиться к шлюзу TrustCommerce. Проверьте подключение к сети.',
		'dnsfailure' => 'TCLink не удалось преобразовать доменное имя в IP-адрес. Убедитесь, что служба DNS доступна на этом компьютере.',
		'linkfailure' => 'Соединение было установлено, но оборвалось до завершения транзакции.',
		'failtoprocess' => 'Серверы банка недоступны. Попробуйте повторить попытку позже, или использовать карточку другого банка.',
	)
);
